Revit 2026 API

# BuiltInFailuresInterferenceFailures Class

---

Failures about Interference.

SystemObject Autodesk.Revit.DBBuiltInFailuresInterferenceFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class InterferenceFailures
```
```vb
Public NotInheritable Class InterferenceFailures
```
```cpp
public ref class InterferenceFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type InterferenceFailures = class end
```

The BuiltInFailuresInterferenceFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GeometryWarning | A geometrical error has occurred while checking for Interference. Reported interference may not be accurate. |

#### Reference

Autodesk.Revit.DB Namespace